import { NextApiRequest, NextApiResponse } from 'next';

import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

export default async function handler(
  req: NextApiRequest,
  res: NextApiResponse
) {
  await prisma.temples.deleteMany();
  await prisma.defense_structures.deleteMany();
  await prisma.museums.deleteMany();

  await prisma.temples.createMany({
    data: [
      {
        name: 'Латинський кафедральний собор',
        description:
          'Латинський кафедральний собор - головний храм римо-католицької церкви у Львові. Офіційна назва - Митрополича базиліка Успіння Пресвято́ї Ді́ви Марі́ї Львівської архідієцезії.\n' +
          '\n' +
          'Будувався та перебудовувався львівськими містобудівниками протягом 400 років. Перший камінь заклав польський король Казимир Великий у 1360 році. Після реставрації 1760-1778 років готичні форми поступилися модним тоді бароковим.\n' +
          '\n' +
          'В катедральному соборі була ікона Матері Божої Милостивої ("Прекрасна зірка міста Львова"), оригінал якої зараз зберігається у краківському Вавелі. ЇЇ точну копію було виготовлено для Львова і в 2001 році папа Іван-Павло II її коронував.\n' +
          '\n' +
          'Зберігся головний орган, вітражі Яна Матейка та інше. У східній стіні видніються ядра, що нагадують про турецьку облогу 1672 року, а також снаряд, що залишився з часів українсько-польської війни 1918-1919 років.\n' +
          '\n' +
          'Наприкінці XVIII сторіччя навколо костелу розташовувався цвинтар з численними каплицями, з яких збереглися лише найцінніші: каплиця Боїмів (1609-1615 роки) та каплиця Кампіанів (1619 роки).\n' +
          '\n' +
          'Латинський катедральний собор є Санктуарієм Матері Божої Милостивої і Божого Милосердя.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37212',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37212',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37211',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37210',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37209',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37208',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37207',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37206',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37205',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37204',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37203',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37202',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37200'
        ],
        location: 'площа Катедральна, 1',
        date_of_foundation: '1360-1493 рр.'
      },
      {
        name: 'Церква Святого Архистратига Михаїла (Костел кармелітів босих)',
        description:
          'Церква Святого Архистратига Михаїла у Львові зведена свого часу як католицький костел монастиря ордену босих кармелітів, який вперше згадується в 1634 році, має довгу історію будівництва.\n' +
          '\n' +
          'Збудований, можливо, за проєктом архітектора Івана Покоровича, сина львівського архітектора італійського походження Адама де Лярто. Башти головного фасаду були спроєктовані архітектором Алоїзом Вондрашкою в 1835-1839 роках, а завершені при реставрації вже в 1906 році архітектором Владиславом Галицьким.\n' +
          '\n' +
          'Розписи костелу виконані в 1731-1732 роках італійським художником Джузеппе Карло Педретті разом зі своїм львівським учнем та помічником Бенедиктом Мазуркевичем. Головний вівтар зроблений із чорного мармуру (XVII століття). Його авторство приписується скульптору Олександру Прохенковичу.\n' +
          '\n' +
          'Як один із оборонних вузлів Львова, кармелітський костел неодноразово зазнавав атак, а в 1748 році навіть послужив ареною так званій "монахомахії" - боротьби між ченцями-кармелітами та капуцинами.\n' +
          '\n' +
          'В 1991 році костел і монастир було передано ченцям Студійського Уставу Української греко-католицької церкви (ордену, заснованого в 1920-х роках митрополитом Андреєм Шептицьким) та наново освячено на честь Святого Архистратига Михайла, святого покровителя України-Руси та хоронителя Гробу Господнього.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40647',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40647',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40646',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40645',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40644',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40642',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/40638'
        ],
        location: 'вулиця Володимира Винниченка, 22',
        date_of_foundation: '1634 рік'
      },
      {
        name: 'Архикатедральний собор Святого Юра',
        description:
          'Архикатедральний собор Святого Юра у Львові - один із найкрасивіших архітектурних ансамблів міста, перлина українського бароко. Головна святиня Української греко-католицької церкви, де тривалий час розташовувалася резиденція митрополитів УГКЦ.\n' +
          '\n' +
          'Першу церкву на Святоюрській горі у Львові було засновано ще за часів Галицько-Волинського князівства. Нинішній храмовий комплекс споруджено в 1744-1770 роках за проєктом Бернарда Меретина, який поєднав стиль рококо з українською сакральною естетикою. На головному фасаді встановлені скульптури Івана Пінзеля. На дзвіниці розміщено найдавніший в Україні дзвін (1341 рік). Найцінніша реліквія храму - чудотворна ікона Пресвятої Діви Марії (XVII століття).\n' +
          '\n' +
          'У соборі Святого Юра поховані митрополити Андрій Шептицький та Володимир Стернюк, патріарх Йосип Сліпий.\n' +
          '\n' +
          'Поруч з собором знаходиться палац митрополитів, в якому в 2001 році зупинявся під час візиту в Україну Папа Іван Павло ІІ.\n' +
          '\n' +
          'З 1998 року собор Святого Юра разом із ансамблем історичного центру Львова входить до списку світової спадщини ЮНЕСКО.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37199',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37199',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37196',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37194',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37189',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37188',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37183',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37182',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37179',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37177'
        ],
        location: 'площа Святого Юра, 5',
        date_of_foundation: '1744-1770 рр.'
      },
      {
        name: 'Бернардинський монастир',
        description:
          'Монастир ордена бернардинів у Львові з костелом Святого Андрія Первозванного в XVII сторіччі являв собою окрему фортифікаційну одиницю за межами міста.\n' +
          '\n' +
          "Був оточений ровом, валом і оборонною стіною, що частково збереглася, з вежею Глинянських воріт, що виходять на Митну площу. Потужні монастирські укріплення були пов'язані з кільцем міських мурів.\n" +
          '\n' +
          "Костел Святого Андрія збудований у 1600-1630 роках за проєктом архітекторів Бернарда Авелідеса та Павла Римлянина в стилі ренесансу. Пишний інтер'єр виконаний в стилі бароко, багато дерев'яних вівтарів XVIII сторіччя. Декоративна колона перед фасадом встановлена в 1736 році на честь Святого Яна з Дуклі, покровителя бернардинців.\n" +
          '\n' +
          'Приміщення монастиря тепер належить Центральному державному архіву Львова, а храм Андрія Первозванного передано Українській греко-католицькій церкві.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37242',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37242',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37241',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37240',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37239',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37237'
        ],
        location: 'площа Соборна, 1-3А',
        date_of_foundation: '1600-1630 рр.'
      },
      {
        name: 'Вірменський кафедральний собор Успіння Пресвятої Богородиці',
        description:
          'У вірменському кварталі Львова між вулицями Вірменською та Лесі Українки знаходиться кафедральний собор, дзвіниця, палац архієпископів та жіночий монастир. Споруди утворюють колоритний "вірменський дворик".\n' +
          '\n' +
          'Будівництво вів архітектор вірменин Дорінг (Дорхі) коштом вірменських купців. В образі собору багато спільних рис із собором у давній вірменській столиці Ані. Упродовж століть собор оновлювався, добудовувався. Найстаріша частина - східна (з XIV сторіччя). Реконструкція 1723 року надала будівлі барокового вигляду.\n' +
          '\n' +
          'У вівтарній частині є традиційні кам\'яні хрести "хачкари". Значну художню цінність становлять скульптурні групи XV століття "Увірування Хоми" та "Свята Софія з доньками".',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37233',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37233',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37232',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37231',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37230',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37229'
        ],
        location: 'вулиця Вірменська, 7-13',
        date_of_foundation: '1363-1370 рр.'
      },
      {
        name: 'Гарнизонний храм святих апостолів Петра і Павла (Костел єзуїтів)',
        description:
          'Гарнизонний храм святих апостолів Петра і Павла (колишній костел Петра і Павла ордену Єзуїтів) - одна з найбільших релігійних споруд міста, перший яскравий зразок маньєризму (раннього бароко) у Львові.\n' +
          '\n' +
          'Будівництво розпочав у 1610 році монах-єзуїт Себастьян Лянхіус, який виступив автором первісного проєкту. Чистий стиль італійського бароко витримав при добудові храму в 1618-1621 роках італійський архітектор Джакомо Бріано, взявши за зразок фасад костелу Іль-Джезу в Римі. В 1630 році будівництво було завершено, храм освятили, але оздоблювальні роботи тривали ще 30 років.\n' +
          '\n' +
          "Тринефний храм. Домінує головний фасад, прикрашений пілястрами, нішами зі статуями та сильно вираженим карнизом. Усередині - пишне барокове оздоблення. Розписи виконали художники Франциск та Себастіан Екштейни з Брно. В одному з бічних вівтарів є високохудожнє дерев'яне розп'яття роботи Яна Пфістера.\n" +
          '\n' +
          'Поруч із костелом знаходиться триповерховий будинок колишньої єзуїтської колегії.\n' +
          '\n' +
          'В 2011 році костел освячено як Гарнізонний храм святих апостолів Петра та Павла УГКЦ.\n' +
          '\n' +
          'У підземних криптах костелу функціонує музей "Підземелля Гарнізонного храму святих апостолів Петра і Павла", де можна замовити екскурсію храмом.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37286',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37286',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37285',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37284',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37283',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37282',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37281'
        ],
        location: 'вулиця Театральна, 11',
        date_of_foundation: '1610-1630 рр.'
      },
      {
        name: 'Домініканський собор (Церква Пресвятої Євхаристії)',
        description:
          "Домініканський собор - одна з найзначніших пам'яток бароко у Львові.\n" +
          '\n' +
          'Келії монастиря домініканців відносяться до XVI сторіччя. В 1559 році княжна Гальшка Острозька, спадкоємиця могутнього волинського роду Острозьких, ховалася тут від магната Лукаша Гурки, який насильно змусив її до шлюбу. В 1701 році цар Петро I підписав тут договір про військовий союз Росії та Польщі проти Швеції.\n' +
          '\n' +
          "До XVIII стопіччя будівля Домініканського костелу була готичною. В 1792-1798 роках архітектором Яном де Вітте коштом Юзефа Потоцького проведено реконструкцію, фасади прикрашені майстром Себастьяном Фесінгером. В інтер'єрі - низка цінних витворів мистецтва: алебастрові надгробні пам'ятники XVI століття, мармуровий пам'ятник Артурові Гротгеру.\n" +
          '\n' +
          "За радянських часів тут був музей атеїзму. Нині це греко-католицька церква Святої Євхаристії. У підземеллях експонується частина колекції пам'яток сакрального мистецтва Львівського музею історії релігії. Проводяться концерти органної музики.",
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37257',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37257',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37256',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37253',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37250'
        ],
        location: 'площа Музейна, 1',
        date_of_foundation: '1745-1764 рр.'
      }
    ]
  });

  await prisma.defense_structures.createMany({
    data: [
      {
        name: 'Глинянська брама',
        description:
          "Глинянська (В'їзна) брама - частина міських укріплень середньовічного Львова, що найбільш збереглася.\n" +
          '\n' +
          "Споруда у стилі пізнього ренесансу є частиною фортифікаційного комплексу Бернардинського монастиря. Брама збудована на початку XVII сторіччя під наглядом інженера Фрідріха Гетканта. У центрі оборонної стіни розташована квадратна вежа з шатровим дахом та арковим проїздом, що вимощений дерев'яною бруківкою.\n" +
          '\n' +
          'Під час реконструкції 1976-1977 років перед стіною відновлено оборонний рів.\n' +
          '\n' +
          'Наразі у комплексі Глинянської брами розміщується інститут "Укрзахідпроектреставрація та адміністрація історико-архітектурного заповідника".',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42132',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42132',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42131',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42130',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42129'
        ],
        location: 'вулиця Валова, 20',
        date_of_foundation: '17 ст.'
      },
      {
        name: 'Львівська цитадель',
        description:
          'Львівська цитадель - комплекс фортифікаційних споруд австрійських часів, що дійшов до нас із XIX століття майже без змін.\n' +
          '\n' +
          "Споруджена на узгір'ї на південно-західних підступах до Львова для контролю над містом та стрийською дорогою.\n" +
          '\n' +
          'Фортифікаційні роботи тут розпочато поляками ще в 1635 році під керівництвом королівського інженера Фрідріха Ґетканта. В 1672 році під час облоги Львова укріплення використовували війська турецького султана Мухамеда IV. У 1852-1854 роках австрійська влада реконструювала і розширила фортецю, спорудивши корпус казарм, дві квадратні та чотири круглі вежі.\n' +
          '\n' +
          'Комплекс не зіграв значної ролі під час світових воєн, завдяки чому чудово зберігся. У радянські часи на території був розбитий парк "Цитадель", приміщення використовувалися як с ...',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/41524',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/41524',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/42142',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/41523'
        ],
        location: 'вулиця Павла Грабовського, 11',
        date_of_foundation: '1850-1856 рр.'
      },
      {
        name: 'Музей-Арсенал (Міський арсенал)',
        description:
          'Будівля Міського арсеналу Львова є однією зі збережених частин міських фортифікаційних укріплень XVI століття.\n' +
          '\n' +
          'Перша невелика зброярня існувала на цьому місці ще на початку XV століття, але після пожежі 1571 року її знесли та збудували в 1574-1575 роках нове двоповерхове приміщення для виготовлення та зберігання зброї. Архітекторами ймовірно були відомі львівські будівничі Павло Щасливий та Себастян Мочиґемба.\n' +
          '\n' +
          'Східним боком Арсенал прилягав до Високого оборонного муру між Токарівською і Шевською вежами. Перед будівлею стояла бастея. При арсеналі були відкриті майстерні для відливу гармат та дзвонів, лагодження зброї. Поряд містився склад боєприпасів.\n' +
          '\n' +
          "За австрійської влади у XVIII столітті будівля використовувалася як неофіційна в'язниця. Зокрема, в ній утримували гайдамаків - учасників Коліївщини, про що нагадує меморіальна дошка.\n" +
          '\n' +
          'В 1981 році в приміщеннях Міського арсеналу відкрився музей "Арсенал", який представляє одну з найкращих у країні колекцій зброї з 30 країн світу. В експозиції: давньоруські та козацькі булави, витончені арабські шаблі, кинджали народів Кавказу та арабського Сходу, важкі європейські дворучні мечі, обладунки польських "крилатих гусар", рушниці і пістолети з різними типами замків, гармати з гербами та багато іншого. Чимало пам’яток декоровано дорогоцінними металами, самоцвітами, слоновою кісткою, перлами, коралами, перламутром. І це лише невелика частина колекції зброї Львівського історичного музею, яка налічує близько 4,5 тисяч одиниць.\n' +
          '\n' +
          'При музеї працює антикварний салон.\n' +
          '\n' +
          'Відвідувачам із порушеннями зору пропонується аудіодискрипція.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32807',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32808',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32809',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32810',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32806'
        ],
        location: 'вулиця Підвальна, 5',
        date_of_foundation: '1554-1556 рр.'
      },
      {
        name: 'Порохова вежа',
        description:
          "Порохова вежа - фрагмент оборонних споруд Львова, що повністю зберігся. Одна з 17 веж, що входили в кільце міських укріплень. Пам'ятник військово-оборонної архітектури епохи ренесансу.\n" +
          '\n' +
          'Порохова вежа була розташована на оборонному валу за другою лінією фортифікацій, служила для захисту підступів до міста зі східного боку. Також використовувалася для зберігання пороху та боєприпасів, а у мирний час – як склад зерна.\n' +
          '\n' +
          'Побудована з необтесаного каменю, напівкругла в плані, триповерхова, накрита гостроверхим дахом. Товщина стін сягає 2,5 метрів. За більш ніж чотири століття рівень землі, що піднявся, приховав нижню частину вежі на півтора-два метри.\n' +
          '\n' +
          'З 1959 року приміщення займав Будинок архітектора з виставковою залою. Тепер тут розміщується Центр архітектури, дизайну та урбаністики "Порохова Вежа".\n',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37140',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37140',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37139',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37138',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37137'
        ],
        location: 'вулиця Підвальна, 4',
        date_of_foundation: '1554-1556 рр.'
      }
    ]
  });

  await prisma.museums.createMany({
    data: [
      {
        name: 'Музей "Личаківський цвинтар"',
        description:
          'Личаківський цвинтар-музей, розташований неподалік центру міста Львова, більше схожий на ландшафтний парк.\n' +
          '\n' +
          "Офіційно цвинтар засновано в 1784 році, хоча він на цьому місці існував ще в XVI сторіччі. Територія в 40 гектарів розбита на 86 полів, на яких знаходяться майже 3,5 тисячі пам'яток та композицій роботи відомих скульпторів та архітекторів. Тут поховані Іван Франко, Соломія Крушельницька, Марія Конопницька, Володимир Івасюк та інші.\n" +
          '\n' +
          'В 1991 році Личаківський цвинтар став історико-меморіальним музеєм-заповідником.\n' +
          '\n' +
          'Багато протиріч у 1990-х роках викликало відновлення знищеного за радянських часів меморіалу "Цвинтар орлят" на честь польських воїнів, які загинули в 1918-1920 роках в українсько-польській та радянсько-польській війні. Офіційно меморіал було відкрито в 2005 році одночасно з меморіалом загиблим воїнам Української Галицької Армії.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37333',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37333',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37332',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37331',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37330',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37329',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37327',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37324',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37322',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37321',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/37320'
        ],
        location: 'вулиця Пекарська, 95',
        date_of_foundation: '1784 р.'
      },
      {
        name: 'Музей Івана Георгія Пінзеля (Костел кларисок)',
        description:
          'Музей видатного українського скульптора доби бароко Івана Георгія Пінзеля розташований у колишньому костелі кларисок у Львові, що є пам’яткою архітектури XVII століття.\n' +
          '\n' +
          "Скромний за архітектурою, але розкішно розписаний з середини храм споруджений у 1607 році Павлом Римлянином і Бернардом Авелідесом на місці старої каплиці монахинь кларисок бернардинського ордену. З тих часів збереглись ренесансні елементи бічного фасаду костелу від вулиці Личаківської. У 1740-х роках костел зазнав реконструкції у бароковому стилі, а під час реставрації 1938-1939 років було добудовано вежу. Інтер'єри храму прикрашають зроблені у XVIII столітті розписи Станіслава Строїнського, окремі пізніші сюжети у південній наві належать пензлю Тадеуша Попеля.\n" +
          '\n' +
          'З 1996 року в костелі кларисок розташовується Музей барокової скульптури Івана Георгія Пінзеля, якого називають "українським Мікеланджело". Тут зібрано найбагатшу колекцію унікальних барокових скульптур майстра, які вдалося відшукати і врятувати в 1970-х роках. Музей Івана Георгія Пінзеля є відділом Львівської національної галереї мистецтв імені Бориса Возницького.\n' +
          '\n' +
          "Після реконструкції 2021 року оновлений музей скульптури Пінзеля отримав повністю безбар'єрний простір. Від зупинки громадського транспорту та в середині будівлі прокладені тактильні смуги. На вході встановлені звукові маячки. Музей має інклюзивну касу та мнемосхему на вході. Внутрішні сходи продубльовані підйомником. Біля експонатів встановлені інформаційні таблички, що продубльовані шрифтом Брайля. Відвідувачам з порушенням зору пропонують тактильні копії найважливіших експонатів. Доступні аудіогіди та аудіодескрипція. Персонал пройшов підготовку для роботи з усіма категоріями відвідувачів.",
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32763',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32763',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32768',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32767',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32766',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32765',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/32764'
        ],
        location: 'площа Митна, 2',
        date_of_foundation: '1607 р.'
      },
      {
        name: 'Музей науки',
        description:
          '"Музей науки Львів" - це інтерактивний простір площею понад 2000 квадратних метрів, який допомагає пізнати світ завдяки дослідам і взаємодії з експонатами.\n' +
          '\n' +
          'Кожен із дев\'яти експозиційних блоків музею розкриває окрему тему: "Повітря", "Вода", "Акустика", "Оптика", "Електрика", "Наука", "Людина", "Роботи", "Формула-1". Понад 100 інтерактивних експонатів дають можливість провести експерименти з пневматичними пристроями та мильними бульбашками, влаштувати мініураган або морський щторм, виробити електроенергію на мініелектростанції, пограти на музичних інструментах у студії звукозапису, поспілкуватися з роботом RoboThespian, покерувати роборукою KUKA KR 210, побувати в різних куточках Землі завдяки VR-технологіям та навіть поміняти колеса гоночної автівки на пітстопі.\n' +
          '\n' +
          "На першому поверсі розташована зона відпочинку з кав'ярнею та сувенірною крамницею.\n" +
          '\n' +
          'Двоповерхова будівля львівського музею науки облаштована з урахуванням стандартів доступності, зокрема обладнана ліфтом.',
        main_image: 'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36920',
        images: [
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36920',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36919',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36916',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36914',
          'https://travels.in.ua/api/Photo/PhotoStreamCPOI/36913'
        ],
        location: 'вулиця Стрийська, 200А',
        date_of_foundation: '2022 р.'
      }
    ]
  });

  return res.status(200).json({ name: 'hello' });
}
